a,b,c,d,e,f= range(6)
# 主容器、节点列表均为列表
ug1 = [
    ['b','c','d','f'],
    ['f'],
    ['d','e','f'],
    ['e'],
    ['f'],
    ['e']
]
print("节点a的邻接点个数是："+str(len(ug1[a])))
print("节点c的邻接点是：",[item for item in ug1[c]])

# 主容器为列表，节点为set类型
ug2 = [
    {'b','c','d','f'},
    {'f'},
    {'d','e','f'},
    {'e'},
    {'f'},\
    {'e'}
]
print("节点a的邻接点个数是：",str(len(ug2[a])))
print("节点c的邻接点是：",[item for item in ug2[c]])

# 主容器为字典，节点为set类型
ug3 = {
    "a":{'b','c','d','f'},
    "b":{'f'},
    "c":{'d','e','f'},
    "d":{'e'},
    "e":{'f'},
    "f":{'e'}
}
print("节点a的邻接点个数是：",str(len(ug3["a"])))
print("节点c的邻接点是：",[item for item in ug3["c"]])

# 邻接矩阵
unm = [
    [0,1,1,1,0,1],
    [0,0,0,0,0,1],
    [0,0,0,1,1,1],
    [0,0,0,0,1,0],
    [0,0,0,0,0,1],
    [0,0,0,0,1,0]
]
print("在unm中，节点a的邻接点个数是",sum(1 for ele in unm[a] if ele>0))
print("在unm中，a是否与c邻接：",unm[a][c]>0)

# 加权邻接矩阵,此处将没有邻接的两个节点的边的权重定义为-1
wam=[
    [-1,1,2,4,-1,5],
    [-1,-1,-1,-1,-1,3],
    [-1,-1,-1,-1,2,3],
    [-1,-1,1,-1,-1],
    [-1,-1,-1,-1,-1,2],
    [-1,-1,-1,-1,3,-1]
]
print("在unm中，节点a的邻接点个数是",sum(1 for ele in wam[a] if ele>0))
print("在unm中，a是否与c邻接：",wam[a][c] > 0 )
